Task 1 <br>
Inspect the file yob2021.txt in a text editor. What do you observe about the structure of the file? <br>

Usually these questions are the most relevant:<br>

How many columns are there?<br>

How are columns separated?<br>

Is there a header on top of the files?

- 3 columns <br>
- Columns are separated by commas <br>
- No header

Task 2 <br>
Read the file ‘yob2021.txt’ into pandas.

In [11]:
import pandas as pd
df = pd.read_csv('names/yob2021.txt', names= ['name', 'gender', 'count'])

df

            name gender  count
0         Olivia      F  17824
1           Emma      F  15530
2      Charlotte      F  13352
3         Amelia      F  13024
4            Ava      F  12854
...          ...    ...    ...
31724     Zyeire      M      5
31725       Zyel      M      5
31726      Zyian      M      5
31727      Zylar      M      5
31728        Zyn      M      5

[31729 rows x 3 columns]

Task 3 <br>
Print the first 10 rows.

In [5]:
df.head(10)

      Olivia  F  17824
0       Emma  F  15530
1  Charlotte  F  13352
2     Amelia  F  13024
3        Ava  F  12854
4     Sophia  F  12559
5   Isabella  F  11288
6        Mia  F  11157
7     Evelyn  F   9484
8     Harper  F   8433
9       Luna  F   8230

Task 4 <br>
Print the first 10 rows.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31728 entries, 0 to 31727
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Olivia  31728 non-null  object
 1   F       31728 non-null  object
 2   17824   31728 non-null  int64
dtypes: int64(1), object(2)
memory usage: 743.8+ KB

Task 5 <br>
Calculate the total number of babies born in 2021, i.e. the sum of the third column.

In [13]:
int(df['count'].sum())

3384687

Task 6 <br>
Like Task 5, but calculate the sum for boys and girls separately.

In [16]:
boy_df = df[df['gender']=='M']
girl_df = df[df['gender']=='F']

boys_born = boy_df['count'].sum()
girls_born = girl_df['count'].sum()

print(f'''boys born: {boys_born}
girls born: {girls_born}''')

boys born: 1746499
girls born: 1638188

Task 7 <br>
Check if your name occurs in the data.

In [17]:
df[df['name']=='Harry']

        name gender  count
18369  Harry      M    358

Task 8 <br>
Calculate the percentage of girls and boys among the total births.

In [22]:
boy_percent = round(boy_df['count'].sum() / df['count'].sum() * 100, 3)
girl_percent = round(girl_df['count'].sum() / df['count'].sum() * 100, 3)

print(f'''boys percent: {boy_percent}%
girls percent: {girl_percent}%''')

boys percent: 51.6%
girls percent: 48.4%

Task 9 <br>
Create a table that contains the top 5 girls names and top 5 boys names.

In [41]:
top_5_boy_names = boy_df.sort_values('count', ascending=False).head(5)
top_5_boy_names

         name gender  count
17649    Liam      M  20391
17650    Noah      M  18884
17651  Oliver      M  14696
17652  Elijah      M  12807
17653   James      M  12452

In [40]:
top_5_girl_names = girl_df.sort_values('count', ascending=False).head(5)
top_5_girl_names

        name gender  count
0     Olivia      F  17824
1       Emma      F  15530
2  Charlotte      F  13352
3     Amelia      F  13024
4        Ava      F  12854

Task 10 <br>
Write the data from task 9 to an excel spreadsheet

In [46]:
common_names = pd.concat([top_5_boy_names, top_5_girl_names])
common_names

            name gender  count
17649       Liam      M  20391
17650       Noah      M  18884
17651     Oliver      M  14696
17652     Elijah      M  12807
17653      James      M  12452
0         Olivia      F  17824
1           Emma      F  15530
2      Charlotte      F  13352
3         Amelia      F  13024
4            Ava      F  12854

In [49]:
common_names.to_excel('common_names.xlsx')